Revit 2027 API
ThermalAsset.Porosity Property
 The porosity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Porosity { get; set; }
Public Property Porosity As Double
	Get
	Set
public:
property double Porosity {
	double get ();
	void set (double value);
}
member Porosity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for porosity is out of range
Remarks
 Values must be in the range 0 to 1.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace